Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དོན་དང་ཡི་གེ་དང་ཐེག་པ་གསུམ་རྣམ་པར་དགོད་པ་ལ་མཁས་པར་རིག་པར་བྱའོ།
en: One should know that they are expert in establishing meaning, words, and the three vehicles. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་སྒྲུབ་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམ་པ་དེ་ལ་ལེགས་པ་འདི་དག་ཡོད་པར་རིག་པར་བྱའོ།
en: Subhūti, one should know that these bodhisattva great beings who practice the perfection of wisdom, who actualize the perfection of wisdom, and who cultivate the perfection of wisdom possess these excellent advantages.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བགྱི།
en: Blessed Lord, how should they practice the perfection of wisdom?

source: ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བགྱི།
en: How should they actualize the perfection of wisdom?

source: ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པར་བགྱི།
en: How should they cultivate the perfection of wisdom?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཟུགས་ཞི་བ་དང་། གཟུགས་རག་ལས་པ་དང་། གཟུགས་གསོག་དང་། གཟུགས་སྙིང་པོ་མེད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: The Blessed One replied, “They should practice the perfection of wisdom through the peace of physical forms, through the hollowness of physical forms, through the vacuity of physical forms, and through the essencelessness of physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཞི་བ་དང་། རྣམ་པར་ཤེས་པ་རག་ལས་པ་དང་། རྣམ་པར་ཤེས་པ་གསོག་དང་། རྣམ་པར་ཤེས་པ་སྙིང་པོ་མེད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: They should practice the perfection of wisdom through the peace of feelings, perceptions, formative predispositions, and consciousness; through the hollowness of consciousness [and so forth]; through the vacuity of consciousness [and so forth]; and through the essencelessness of consciousness [and so forth].

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཞི་བ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རག་ལས་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་གསོག་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྙིང་པོ་མེད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: They should practice the perfection of wisdom through the peace of the sense fields, the sensory elements, and the links of dependent origination; through the hollowness of the links of dependent origination [and so forth]; through the vacuity of the links of dependent origination [and so forth]; and through the essencelessness of the links of dependent origination [and so forth]. {

source: །གང་ཡང་འདི་སྐད་དུ་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱ་ཞེས་ཟེར་བ་ནི།
en: Ki.V: 111} “You also asked how they should actualize the perfection of wisdom.

source: ནམ་མཁའ་སྟོང་པ་ཉིད་མངོན་པར་བསྒྲུབས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: In this regard, they should actualize the perfection of wisdom through the actualization of the emptiness of space.

source: །གང་ཡང་འདི་སྐད་དུ་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསྒོམ་པར་བྱ་ཞེས་ཟེར་བ་ནི།
en: You also asked how they should cultivate the perfection of wisdom.

source: བསྒོམ་པ་རྣམ་པར་བསྒོམ་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསྒོམ་པར་བྱའོ།
en: In this regard, they should cultivate the perfection of wisdom through the breaking down of cultivation.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡུན་རིང་པོ་ཇི་སྲིད་ཅིག་ཏུ་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, for how long will they practice it?” “

source: སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: They should practice the perfection of wisdom commencing from the time when they first begin to set their mind on enlightenment until they are seated at the site of enlightenment.

source: །དེ་ལྟར་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: They should actualize it in that manner.

source: །དེ་ལྟར་བསྒོམ་པར་བྱའོ། །གསོལ་པ།
en: They should cultivate it in that manner,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་སེམས་ཀྱི་རྒྱུན་མ་ཆད་པ་དང་། མ་བྲལ་བར་སྤྱད་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how should they practice without interruption and without separation from the mind set on enlightenment?” “

source: ཡིད་ལ་བྱ་བ་གཞན་གྱི་གོ་སྐབས་མ་དབྱེ་བས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: They should practice the perfection of wisdom by not allowing an opportunity for other considerations to intrude.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱ་བ་མི་འདོར་བས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པར་བྱ་སྟེ།
en: They should practice the perfection of wisdom, they should actualize the perfection of wisdom, and they should cultivate the perfection of wisdom by never giving up focusing their attention on all-aspect omniscience.

source: ཅི་ནས་ཀྱང་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་མི་རྒྱུ་བ་དེ་ལྟར་སྤྱད་པར་བྱའོ།
en: By whatever means they should practice it in such a way that the phenomena constituting mind and mental states are unmoved.

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབས་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམས་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རམ།
en: Blessed Lord, will those who have practiced the perfection of wisdom, activated the perfection of wisdom, and cultivated the perfection of wisdom attain all-aspect omniscience?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་ནི་མ་ཡིན་ནོ། །གསོལ་པ།
en: No,” replied the Blessed One. “

source: འོ་ན་ཅི་ལགས་མ་བསྒོམས་པས་སམ།
en: In that case, will those who have not cultivated it do so?” “

source: འོ་ན་ཅི་ལགས། བསྒོམས་ཀྱང་བསྒོམས་ལ། མ་བསྒོམས་ཀྱང་མ་བསྒོམས་པས་སམ།
en: In that case, will those who have both cultivated and not cultivated it do so?” “

source: འོ་ན་ཅི་ལགས།
en: Ki.

source: བསྒོམས་པ་ཡང་མ་ལགས། མ་བསྒོམས་པ་ཡང་མ་ལགས་པས་སམ།
en: V: 112} “In that case, will those who have neither cultivated nor not cultivated it do so?” “

source: བཅོམ་ལྡན་འདས་འོ་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཇི་ལྟར་ཐོབ་པར་བགྱི།
en: In that case, Blessed Lord, how will they attain all-aspect omniscience?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་བཞིན་ནོ། །གསོལ་པ།
en: In accordance with the real nature,” replied the Blessed One. “

source: དེ་བཞིན་ཉིད་ཇི་ལྟ་བུ་ལགས།
en: How is the real nature?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཡང་དག་པའི་མཐའ་ཇི་ལྟ་བ་བཞིན་ནོ། །གསོལ་པ།
en: It accords with the very limit of reality,” replied the Blessed One. “

source: ཡང་དག་པའི་མཐའ་ཇི་ལྟ་བུ་ལགས།
en: How is the very limit of reality?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཆོས་ཀྱི་དབྱིངས་ཇི་ལྟ་བ་བཞིན་ནོ། །གསོལ་པ།
en: It accords with the realm of phenomena,” replied the Blessed One. “

source: ཆོས་ཀྱི་དབྱིངས་ཇི་ལྟ་བུ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: How is the realm of phenomena?” “

source: བདག་གི་ཁམས་དང་། སེམས་ཅན་གྱི་ཁམས་དང་སྲོག་གི་ཁམས་དང་། གང་ཟག་གི་ཁམས་ཇི་ལྟ་བ་བཞིན་ནོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གི་ཁམས་དང་།
en: It accords with the elements constituting the self, the elements constituting beings, the elements constituting life forms, and the elements constituting individual personalities,” replied the Blessed One. “

source: སེམས་ཅན་གྱི་ཁམས་དང་སྲོག་གི་ཁམས་དང་། གང་ཟག་གི་ཁམས་ཇི་ལྟ་བུ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how are the elements constituting the self, the elements constituting beings, the elements constituting life forms, and the elements constituting individual personalities?” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། བདག་གམ་སེམས་ཅན་ནམ་སྲོག་གམ་གང་ཟག་གི་དམིགས་སུ་ཡོད་དམ།
en: Subhūti, do you think that the self, sentient beings, life forms, and individual personalities are apprehensible?”

source: རབ་འབྱོར་བདག་གམ་སེམས་ཅན་ནམ་སྲོག་གམ་གང་ཟག་མི་དམིགས་ན། ཇི་ལྟར་བདག་གི་ཁམས་དང་སེམས་ཅན་གྱི་ཁམས་དང་སྲོག་གི་ཁམས་དང་གང་ཟག་གི་ཁམས་སུ་གདགས་པར་བྱ།
en: Subhūti,” continued the Blessed One, “if the self, sentient beings, life forms, and individual personalities are not apprehended, how could one conceive of the elements constituting the self, the elements constituting beings, the elements constituting life forms, and the elements constituting individual personalities?

source: དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་མ་བཏགས་པ་དང་། ཆོས་ཐམས་ཅད་དུ་མ་བཏགས་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ། །གསོལ་པ།
en: Without conceiving of the perfection of wisdom and without conceiving of anything, they will attain all-aspect omniscience.” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གདགས་སུ་མ་མཆིས་པ་ལགས་སམ།
en: Blessed Lord, is the perfection of wisdom inconceivable?

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གདགས་སུ་མ་མཆིས་པ་ལགས་སམ།
en: Are the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity inconceivable?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་གདགས་སུ་མ་མཆིས་པ་ལགས་སམ།
en: Are [the attributes and goals], up to and including all-aspect omniscience, inconceivable?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གདགས་སུ་མེད་པའོ།
en: Subhūti,” replied the Blessed One, “the perfection of wisdom is inconceivable.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གདགས་སུ་མེད་པའོ།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are inconceivable.

source: །ནང་སྟོང་པ་ཉིད་ནི་གདགས་སུ་མེད་པའོ།
en: The emptiness of internal phenomena is inconceivable. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་གདགས་སུ་མེད་པའོ།
en: All the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are inconceivable.

source: །དྲན་པ་ཉེ་བར་བཞག་པ་རྣམས་ནི་གདགས་སུ་མེད་པའོ།
en: The applications of mindfulness are inconceivable.

source: །ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་གདགས་སུ་མེད་པའོ།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are inconceivable. [

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ནི་གདགས་སུ་མེད་པའོ།
en: The fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are inconceivable. [

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་ནི་གདགས་སུ་མེད་པའོ། །འདུས་བྱས་སམ།
en: The goals], up to and including unsurpassed, complete enlightenment, are inconceivable. “

source: འདུས་མ་བྱས་སམ། ཉན་ཐོས་ཀྱི་ཆོས་སམ། རང་སངས་རྒྱས་ཀྱི་ཆོས་སམ། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་སམ། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་རུང་སྟེ་ཆོས་ཐམས་ཅད་ནི་གཉིས་སུ་མེད་པའོ།
en: All phenomena, be they conditioned or unconditioned, be they attributes of the śrāvakas, attributes of the pratyekabuddhas, attributes of the bodhisattvas, or attributes of the buddhas, are inconceivable.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་ཆོས་ཐམས་ཅད་གདགས་སུ་མ་མཆིས་པ་ལགས་ན།
en: Blessed Lord, if all phenomena are inconceivable in this manner, {Ki.

source: བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་སེམས་ཅན་དམྱལ་བ་མཆིས་པར་གྱུར།
en: V: 113} in that case, Blessed Lord, why are the hells conceived?

source: བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་མཆིས་པར་གྱུར།
en: Why are the animal realm and the world of Yama conceived?

source: ལྷ་དང་མི་མཆིས་པར་གྱུར།
en: Why are the god realms and the human realm conceived?

source: རྒྱུན་དུ་ཞུགས་པ་མཆིས་པར་གྱུར།
en: Why are those entering the stream to nirvāṇa conceived?

source: ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་མཆིས་པར་གྱུར།
en: Why are those destined for only one more rebirth, those no longer subject to rebirth, and arhats conceived?

source: རང་སངས་རྒྱས་མཆིས་པར་གྱུར།
en: Why are pratyekabuddhas conceived?

source: བྱང་ཆུབ་སེམས་དཔའ་མཆིས་པར་གྱུར།
en: Why are bodhisattvas conceived?

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཆིས་པར་གྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Why are completely awakened buddhas conceived?” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སེམས་ཅན་དུ་གདགས་པ་དམིགས་སུ་ཡོད་དམ།
en: Subhūti, do you think that the concept of beings is apprehensible?”

source: རབ་འབྱོར་སེམས་ཅན་དམིགས་སུ་མེད་ན། སེམས་ཅན་དམྱལ་བར་ཡང་ཇི་ལྟར་གདགས་པར་བྱ།
en: Subhūti,” continued the Blessed One, “if beings are not apprehensible, how could the denizens of the hells be conceived?

source: བྱོལ་སོང་གི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་ནམ་ལྷ་འམ་མི་འམ་རྒྱུན་དུ་ཞུགས་པ་འམ། ལན་ཅིག་ཕྱིར་འོང་བ་འམ་ཕྱིར་མི་འོང་བ་འམ་དགྲ་བཅོམ་པ་འམ། རང་སངས་རྒྱས་སུ་ཡང་ཇི་ལྟར་གདགས་པར་བྱ།
en: How indeed could the animal realm, the world of Yama, the realms of gods or humans, those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, or pratyekabuddhas be conceived?

source: བྱང་ཆུབ་སེམས་དཔའ་འམ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་ཡང་ཇི་ལྟར་གདགས་པར་བྱ།
en: How could bodhisattvas or completely awakened buddhas be conceived? “

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། གདགས་སུ་མེད་པའི་ཆོས་ཐམས་ཅད་ལ་བསླབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings who practice the perfection of wisdom in that manner should train in all phenomena that are inconceivable.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་འོ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། གཟུགས་ལ་བསླབ་པ་དང་།
en: In that case, Blessed Lord, should bodhisattva great beings who practice the perfection of wisdom train in physical forms?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ལ་བསླབ་པ་དང་།
en: Should they train in feelings, perceptions, formative predispositions, and consciousness?

source: སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་བསླབ་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: Should they train in the sense fields, the sensory elements, and the links of dependent origination?

source: སྟོང་པ་ཉིད་ཐམས་ཅད་ལ་བསླབ་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་བསླབ་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: Should they train in all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment?

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ལ་བསླབ་པ་དང་།
en: Should they train in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways?

source: སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་བསླབ་པ་དང་།
en: Should they train in the ten powers [of the tathāgatas], the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བསླབ་པར་བགྱི་འམ།
en: Should they train in all-aspect omniscience?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཟུགས་ལ་དབྲི་བ་དང་བསྣན་པ་མེད་པར་བསླབ་པར་བྱའོ།
en: The Blessed One replied, “They should train in physical forms without subtraction or addition.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ལ་དབྲི་བ་དང་བསྣན་པ་མེད་པར་བསླབ་པར་བྱའོ།
en: They should train in feelings, perceptions, formative predispositions, and consciousness without subtraction or addition.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་དབྲི་བ་དང་བསྣན་པ་མེད་པར་བསླབ་པར་བྱའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: They should train in the sense fields, the sensory elements, and the links of dependent origination without subtraction or addition.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་དབྲི་བ་དང་བསྣན་པ་མེད་པར་བསླབ་པར་བྱའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: They should train in all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment without subtraction or addition.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་དབྲི་བ་དང་བསྣན་པ་མེད་པར་བསླབ་པར་བྱའོ།
en: They should train in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways without subtraction or addition.

source: །སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་དབྲི་བ་དང་བསྣན་པ་མེད་པར་བསླབ་པར་བྱའོ།
en: They should train in the ten powers [of the tathāgatas], the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas without subtraction or addition. {

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་དབྲི་བ་དང་བསྣན་པ་མེད་པར་བསླབ་པར་བྱའོ།
en: Ki.V: 114} They should train in [the goals], up to and including all-aspect omniscience, without subtraction or addition.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་གཟུགས་ལ་དབྲི་བ་དང་བསྣན་པ་མ་མཆིས་པར་བསླབ་པར་བགྱི།
en: Blessed Lord, how should they train in physical forms without subtraction or addition?

source: ཇི་ལྟར་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ལ་དབྲི་བ་དང་བསྣན་པ་མ་མཆིས་པར་བསླབ་པར་བགྱི།
en: How should they train in feelings, perceptions, formative predispositions, and consciousness without subtraction or addition?

source: ཇི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་དབྲི་བ་དང་བསྣན་པ་མ་མཆིས་པར་བསླབ་པར་བགྱི།
en: How should they train in [the attributes and goals], up to and including all-aspect omniscience, without subtraction or addition?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྐྱེ་བ་མེད་པ་དང་འགག་པ་མེད་པར་བསླབ་པར་བྱའོ། །གསོལ་པ།
en: They should train in nonarising and nonceasing,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་སྐྱེ་བ་མ་མཆིས་པ་དང་། འགག་པ་མ་མཆིས་པ་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི།
en: Blessed Lord, how should they train in nonarising and nonceasing?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདུ་བྱེད་རྣམས་མངོན་པར་འདུ་བྱ་བ་མེད་པར་བསྒོམ་པ་འམ་རྣམ་པར་བསྒོམ་པ་ལ་བསླབ་པར་བྱའོ།
en: They should train in the cultivation or breaking down of the nonconditioning of formative predispositions,” replied the Blessed One. “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་མངོན་པར་འདུ་བགྱི་བ་མ་མཆིས་པ་ལ་བསླབ་པར་བགྱི།
en: Blessed Lord, how should they train in nonconditioning?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཆོས་རྣམས་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་མཐོང་བས། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་བསླབ་པར་བྱའོ། །གསོལ་པ།
en: They should train in nonconditioning by seeing that all phenomena are empty of their own defining characteristics,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་ཆོས་རྣམས་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཇི་ལྟར་བལྟ་བར་བགྱི།
en: Blessed Lord, how should they see that all phenomena are empty of their own defining characteristics?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཟུགས་གཟུགས་ཀྱིས་སྟོང་པར་བལྟའོ།
en: The Blessed One replied, “They should see that physical forms are empty of physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་ཤེས་པས་སྟོང་པར་བལྟའོ།
en: They should see that feelings, perceptions, formative predispositions, and consciousness are empty of consciousness [and so forth].

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བས་སྟོང་པར་བལྟའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: They should see that the sense fields, the sensory elements, and the links of dependent origination are empty of the links of dependent origination [and so forth].

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱིས་སྟོང་པར་བལྟའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་།
en: They should see that all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are empty of the thirty-seven factors conducive to enlightenment [and so forth]. {

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: Ki.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱིས་སྟོང་པར་བལྟའོ།
en: V: 115} They should see that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are empty of the dhāraṇī gateways [and so forth].

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱིས་སྟོང་པར་བལྟའོ།
en: They should see that the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are empty of the distinct qualities of the buddhas [and so forth].

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་བྱང་ཆུབ་ཀྱིས་སྟོང་པར་བལྟའོ།
en: They should see that [the goals], up to and including unsurpassed, complete enlightenment, are empty of unsurpassed enlightenment [and so forth].

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལ་བསླབ་པར་བྱའོ།
en: Subhūti, it is in this way that bodhisattva great beings who practice the perfection of wisdom should train in all phenomena as being empty of their own defining characteristics.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པས་སྟོང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་ནི་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཀྱིས་སྟོང་ན། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པར་འགྱུར།
en: Blessed Lord, if in this way physical forms are empty of physical forms; and feelings, perceptions, formative predispositions, and consciousness are empty of consciousness [and so forth]; and [all the attributes and goals], up to and including all-aspect omniscience, are empty of unsurpassed enlightenment [and so forth], in that case, Blessed Lord, how will bodhisattva great beings practice the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་སྤྱོད་པ་མེད་པ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའོ། །གསོལ་པ།
en: Subhūti, the practice of the perfection of wisdom that bodhisattva great beings have is without practice,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་སྤྱོད་པ་མ་མཆིས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, why is the practice of the perfection of wisdom without practice?” “

source: རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་མི་དམིགས། བྱང་ཆུབ་སེམས་དཔའ་ཡང་མི་དམིགས། སྤྱོད་པ་ཡང་མི་དམིགས། གང་སྤྱོད་པ་དང་།
en: Subhūti,” replied the Blessed One, “it is because the perfection of wisdom is not even apprehended, nor are the bodhisattvas apprehended, nor indeed is practice apprehended.

source: གང་གིས་སྤྱོད་པ་དང་། གང་ལ་སྤྱོད་པ་དེ་ཡང་མི་དམིགས་ཏེ།
en: That is to say, there is no apprehending at all of any practice, of anyone who practices, or of anything that is practiced.
